PROGRAM

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv("STUDENTSCORE_DATASET.csv")

In [6]:
df

    Hours  Scores
0     2.5      21
1     5.1      47
2     3.2      27
3     8.5      75
4     3.5      30
5     1.5      20
6     9.2      88
7     5.5      60
8     8.3      81
9     2.7      25
10    7.7      85
11    5.9      62
12    4.5      41
13    3.3      42
14    1.1      17
15    8.9      95
16    2.5      30
17    1.9      24
18    6.1      67
19    7.4      69
20    2.7      30
21    4.8      54
22    3.8      35
23    6.9      76
24    7.8      86

In [8]:
df.shape #to view structure of data

(25, 2)

In [9]:
df.head(10) #for viewing first 10 rows

   Hours  Scores
0    2.5      21
1    5.1      47
2    3.2      27
3    8.5      75
4    3.5      30
5    1.5      20
6    9.2      88
7    5.5      60
8    8.3      81
9    2.7      25

In [10]:
df.tail(5) #for last 5 rows

    Hours  Scores
20    2.7      30
21    4.8      54
22    3.8      35
23    6.9      76
24    7.8      86

In [11]:
df.columns

Index(['Hours', 'Scores'], dtype='object')

In [14]:
df.Scores

0     21
1     47
2     27
3     75
4     30
5     20
6     88
7     60
8     81
9     25
10    85
11    62
12    41
13    42
14    17
15    95
16    30
17    24
18    67
19    69
20    30
21    54
22    35
23    76
24    86
Name: Scores, dtype: int64

In [15]:
df.describe()

           Hours     Scores
count  25.000000  25.000000
mean    5.012000  51.480000
std     2.525094  25.286887
min     1.100000  17.000000
25%     2.700000  30.000000
50%     4.800000  47.000000
75%     7.400000  75.000000
max     9.200000  95.000000

In [18]:
df.Scores.max()

95

In [19]:
df.Scores.min()

17

In [20]:
df.Scores.mean()

51.48

In [21]:
df.Scores.std()

25.28688724747802

In [23]:
df.iloc[0,1] #for select a specifc value using index

21

In [24]:
df.iloc[3]

Hours      8.5
Scores    75.0
Name: 3, dtype: float64

In [25]:
df.iloc[[2,3,4],:]

   Hours  Scores
2    3.2      27
3    8.5      75
4    3.5      30

In [29]:
df.iloc[:-10,:] #except the last 10 rows

    Hours  Scores
0     2.5      21
1     5.1      47
2     3.2      27
3     8.5      75
4     3.5      30
5     1.5      20
6     9.2      88
7     5.5      60
8     8.3      81
9     2.7      25
10    7.7      85
11    5.9      62
12    4.5      41
13    3.3      42
14    1.1      17